app/controllers/pins_controller.rb

  def pinsof
    @user_id = params[:user_id]
    @user = User.find(@user_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    @pin = Pin.new(pin_params)
    @pin.user_id = current_user.id
    respond_to do |format|
      if @pin.save
---
INSERT INTO "pins" ("photo", "description", "created_at", "updated_at", "name", "user_id") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @pin.update(pin_params)
---
UPDATE "pins" SET "photo" = ?, "updated_at" = ? WHERE "pins"."id" = ?  [["photo", "https://eldiariony.files.wordpress.com/2017/12/screen-shot-2017-12-22-at-6-08-24-pm.png?w=859"], ["updated_at", "2019-05-31 04:50:22.336227"], ["id", 1]]